# 設定
%k = (
	p_name		=> '@全てを支配する者@',	# クエスト名
	p_join		=> 6,				# 戦闘参加上限(人)
	p_leader	=> 'ドールマスター',		# クエストリーダー名
	speed		=> 12,				# 進行スピード(秒)
	need_join	=> 'hp_200_o',		# 参加条件(./lib/quest.cgi 192行目あたりを参考)
);


# 封印戦戦利品(道具No)
@treasures = (
[], # 武器No
[], # 防具No
[59,71,71,107], # 道具No
);

# ボス
@bosses= (
	{
		name		=> 'ドールマスター',
		hp			=> 150000,
		at			=> 500,
		df			=> 250,
		ag			=> 350,
		get_exp		=> 8000,
		get_money	=> 4000,
		icon		=> 'mon/705.gif',
		
		hit			=> 1000, # 長期戦用命中率500%
		job			=> 55, # 妖精
		sp			=> 999,
		old_job		=> 96, # 洗脳
		old_sp		=> 999,
		mmp			=> 9999999,
		mp			=> 999999,
		tmp			=> '100倍',
		state		=> '全封',
	},
);



1;
