#=================================================
# 錬金レシピ Created by Merino
#=================================================
# ２つを組み合わせ。３つ以上を組み合わせとかはできません。

# 例＞
# 'アイテム名１'	=> { 'アイテム名２'		=> '完成品', },

# アイテム１をベースにアイテム２が複数ある場合
#	'アイテム名１'	=> {
#		'アイテム名２'	=> '完成品Ａ',
#		'アイテム名３'	=> '完成品Ｂ',
#		'アイテム名４'	=> '完成品Ｃ',
#		…
#	},
# ※↓だとアイテム名１が上書かれてしまうので、最後に書かれたもの１つしか動作しません
#	'アイテム名１'	=> { 'アイテム名２'		=> '完成品Ａ', },
#	'アイテム名１'	=> { 'アイテム名３'		=> '完成品Ｂ', },
#	'アイテム名１'	=> { 'アイテム名４'		=> '完成品Ｃ', },

# 道具(_data.cgi)の【基本錬金ﾚｼﾋﾟなどで習得する書き方】
# &learn_recipe(qw/アイテム名１ アイテム名１ アイテム名１ アイテム名１…/) のように『アイテム名１』を書く。
# 例＞ &learn_recipe(qw/薬草/) なら「薬草×薬草＝上薬草」「薬草×爆弾石＝ﾄﾞﾗｺﾞﾝ草」のどちらかを習得できる。※２回使用で両方習得

# Memo: 末尾に「#」の目印⇒神のレシピでのみ習得可能
%recipes = (
# 道具
	'薬草'			=> { '薬草'			=> '上薬草', '爆弾石' => 'ﾄﾞﾗｺﾞﾝ草', },
	'上薬草'		=> { '上薬草'		=> '特薬草', },
	'特薬草'		=> { '命の木の実'	=> '世界樹の葉', },
	'毒消し草'		=> { '満月草'		=> 'ﾊﾟﾃﾞｷｱの根っこ', },
	'世界樹の葉'	=> { '魔法の聖水'	=> '世界樹のしずく', },
	'魔法の聖水'	=> { '世界樹のしずく'=> 'ｴﾙﾌの飲み薬', },
	'幸せの種'		=> { '聖者の灰'		=> 'ｽｷﾙの種', },
	'幸せの帽子'	=> { '幸せの種'		=> '幸せのくつ', '幸せのくつ' => '幸福袋', },#
	'幸せのくつ'	=> { '幸せの種'		=> '幸せの帽子', },#
	'ｽｷﾙの種'		=> { '魔法の粉'		=> '幸せの種', },
	'ｷﾒﾗの翼'		=> { '幸せのくつ'	=> '宝物庫の鍵', },#
	'身代わり人形'	=> { '守りの石'		=> '身代わり石像', },
	'身代わり石像'	=> { '守りのﾙﾋﾞｰ'	=> '身代わり騎士', },
	'魔法の粉'		=> { '馬のﾌﾝ'		=> '悪魔の粉', },
	'悪魔の粉'		=> { '時の砂'		=> '聖者の灰', },
	'金の鶏'		=> { '魔物のｴｻ'		=> '金塊', },
	'魔獣の皮',		=> { '幸せの種'		=> '福袋', },
	'竜のｳﾛｺ'		=> { '皮の腰巻'		=> '魔獣の皮', },
	'銀のたてごと'	=> { '魔法の聖水'	=> '魔除けの聖印', },
	'ﾓﾝｽﾀｰ銅貨'		=> { 'ﾓﾝｽﾀｰ銅貨'	=> 'ﾓﾝｽﾀｰ銀貨', },
	'ﾓﾝｽﾀｰ銀貨'		=> { 'ﾓﾝｽﾀｰ銀貨'	=> 'ﾓﾝｽﾀｰ金貨', },
	'ﾓﾝｽﾀｰ金貨'		=> { 'ﾓﾝｽﾀｰ金貨'	=> '小さなﾒﾀﾞﾙ', },
	'祈りの指輪',	=> { '金塊'			=> '金の指輪', },
	'金の指輪'	=> {
		'命の木の実'	=> '命の指輪',
		'不思議な木の実'=> '祈りの指輪',
		'力の種'		=> '力の指輪',
		'守りの種'		=> '守りのﾙﾋﾞｰ',
		'素早さの種'	=> 'はやてのﾘﾝｸﾞ',
		'金の指輪'		=> '金のﾌﾞﾚｽﾚｯﾄ',
		'死者の骨'		=> 'ﾄﾞｸﾛの指輪',
	},
	'闇のﾛｻﾞﾘｵ'		=> { '聖者の灰'		=> '金のﾛｻﾞﾘｵ',	 },
	'金のﾌﾞﾚｽﾚｯﾄ'	=> { '命の指輪'		=> '命のﾌﾞﾚｽﾚｯﾄ',	 },
	'力の指輪'		=> { '力の指輪'		=> 'ごうけつの腕輪', },#
	'はやてのﾘﾝｸﾞ'	=> { 'はやてのﾘﾝｸﾞ'	=> 'ほしふる腕輪', },#
	'ごうけつの腕輪'=> { 'ほしふる腕輪'	 => 'ｱﾙｺﾞﾝﾘﾝｸﾞ', '爆弾石' => 'ﾒｶﾞﾝﾃの腕輪', '金塊' => '怒りのﾀﾄｩｰ' },#
	'ｿｰｻﾘｰﾘﾝｸﾞ'		=> { '悪魔のしっぽ'	=> 'ﾄﾞｸﾛの指輪', },
	'ﾄﾞｸﾛの指輪'	=> { '聖者の灰'		=> 'ｿｰｻﾘｰﾘﾝｸﾞ', },#

# 武器
	'ひのきの棒'	=> { 'ﾀﾞｶﾞｰﾅｲﾌ'		=> '鉄の槍', '鉄の槍' => 'ﾛﾝｸﾞｽﾋﾟｱ', },
	'こんぼう'		=> { 'ﾁｪｰﾝｸﾛｽ'		=> 'ﾓｰﾆﾝｸﾞｽﾀｰ', },
	'ﾌﾞﾛﾝｽﾞﾅｲﾌ'		=> { 'ﾌﾞﾛﾝｽﾞﾅｲﾌ'	=> '銅の剣', '聖者の灰' => '聖なるﾅｲﾌ', },
	'ﾀﾞｶﾞｰﾅｲﾌ'		=> { 'どくばり'		=> 'ｱｻｼﾝﾀﾞｶﾞｰ', },
	'ｿﾞﾝﾋﾞｷﾗｰ'		=> { '魔除けの聖印'	=> 'ｿﾞﾝﾋﾞﾊﾞｽﾀｰ', },
	'ﾙｰﾝｽﾀｯﾌ'		=> { 'ﾗｲﾄｱｰﾏｰ'		=> 'ﾗｲﾄｼｬﾑｰﾙ', },
	'ﾛﾝｸﾞｽﾋﾟｱ'		=> { '聖なるﾅｲﾌ'	=> 'ﾎｰﾘｰﾗﾝｽ', '悪魔のしっぽ' => 'ﾊﾞﾄﾙﾌｫｰｸ', },
	'ﾊﾞﾄﾙﾌｫｰｸ'		=> { 'どくばり'		=> 'ﾃﾞｰﾓﾝｽﾋﾟｱ', },
	'ﾎｰﾘｰﾗﾝｽ'		=> { '悪魔のしっぽ'	=> 'ﾃﾞｰﾓﾝｽﾋﾟｱ', },
	'ﾓｰﾆﾝｸﾞｽﾀｰ'		=> { 'ﾄﾞﾗｺﾞﾝｷﾗｰ'	=> 'ﾄﾞﾗｺﾞﾝﾃｲﾙ', },
	'鋼鉄の剣'		=> { '金塊'			=> 'ﾌﾟﾗﾁﾅｿｰﾄﾞ', '馬のﾌﾝ' => '古びた剣', },
	'ｽﾗｲﾑﾋﾟｱｽ'		=> { 'はやてのﾘﾝｸﾞ'	=> 'ｷﾗｰﾋﾟｱｽ', },
	'理力の杖'		=> { 'ﾄﾞﾗｺﾞﾝ草'		=> 'ﾄﾞﾗｺﾞﾝの杖', },
	'ｸｻﾅｷﾞの剣'		=> { '聖者の灰'		=> 'ﾊﾞｽﾀｰﾄﾞｿｰﾄﾞ', },
	'ﾊﾞｽﾀｰﾄﾞｿｰﾄﾞ'	=> { '氷の刃'		=> '吹雪の剣', '妖精の笛' => '妖精の剣', },

	'銅の剣'		=> { '魔除けの聖印'	=> '聖銀のﾚｲﾋﾟｱ', '馬のﾌﾝ' => '古びた剣', },
	'聖銀のﾚｲﾋﾟｱ'	=> { '悪魔のしっぽ'	=> '堕天使のﾚｲﾋﾟｱ', },
	'堕天使のﾚｲﾋﾟｱ'	=> { 'はやてのﾘﾝｸﾞ'	=> '疾風のﾚｲﾋﾟｱ', },
	'鎖がま'		=> { '鎖がま'		=> '鉄の斧', },
	'鉄の斧'		=> { '鉄の斧'		=> 'ﾊﾞﾄﾙｱｯｸｽ', '金塊' => '金の斧', },
	'金の斧'		=> { '満月草'		=> 'ﾑｰﾝｱｯｸｽ', 'ｽﾗｲﾑの冠' => 'ｷﾝｸﾞｱｯｸｽ',},
	'ﾊﾞﾄﾙｱｯｸｽ'		=> { '盗賊の衣'		=> '山賊の斧', },
	'山賊の斧'		=> { '王者のﾏﾝﾄ'	=> '覇王の斧', },
	'おおきづち'	=> { '鉄の斧'		=> 'おおかなづち', },
	'ｳｫｰﾊﾝﾏｰ'		=> { 'ごうけつの腕輪'=> 'ｳｫｰﾊﾝﾏｰ･改', },#
	'ｳｫｰﾊﾝﾏｰ･改'	=> { '覇王の斧'		=> 'ﾒｶﾞﾄﾝﾊﾝﾏｰ', },#
	'隼の剣'		=> { 'ほしふる腕輪'	=> '隼の剣･改', },#
	'諸刃の剣'		=> { '聖者の灰'		=> '諸刃の剣･改', '魔除けの聖印' => '氷の刃', },#
	'奇跡の剣'		=> { '命のﾌﾞﾚｽﾚｯﾄ'	=> '奇跡の剣･改', },#

	'古びた剣'		=> { 'ｵﾘﾊﾙｺﾝ'		=> 'ﾊｸﾞﾚﾒﾀﾙの剣', },#
	'ﾊｸﾞﾚﾒﾀﾙの剣'	=> { 'ｽﾗｲﾑの冠'		=> 'ﾒﾀﾙｷﾝｸﾞの剣', },#
	'ﾒﾀﾙｷﾝｸﾞの剣'	=> { 'ﾛﾄの印'		=> 'ﾛﾄの剣', },#
	'ﾄﾞﾗｺﾞﾝｷﾗｰ'		=> { 'ごうけつの腕輪'=> 'ﾄﾞﾗｺﾞﾝｽﾚｲﾔｰ', },#
	'ﾄﾞﾗｺﾞﾝｽﾚｲﾔｰ'	=> { 'ｵﾘﾊﾙｺﾝ'		=> '竜神の剣', },#
	'竜神の剣'		=> { 'ﾊｸﾞﾚﾒﾀﾙの剣'	=> '竜神王の剣', },#

# 防具
	'布の服'		=> { '布の服'		=> '旅人の服', },
	'旅人の服'		=> { '魔獣の皮'		=> '皮の鎧', '騎士団の衣装' => '騎士団の服', 'ﾁｪｰﾝｸﾛｽ' => '鎖かたびら', },
	'皮の鎧'		=> { '竜のｳﾛｺ'		=> 'うろこの鎧', },
	'鎖かたびら'	=> { '銅の剣'		=> '青銅の鎧', },
	'鉄の鎧'		=> { '銀のたてごと'	=> 'ｼﾙﾊﾞｰﾒｲﾙ', '馬のﾌﾝ'		=> '古びた鎧' },
	'鋼鉄の鎧'		=> { '諸刃の剣'		=> '刃の鎧', '馬のﾌﾝ'		=> '古びた鎧', '魔獣の皮'		=> 'あつでの鎧',},
	'銀の胸当て'	=> { '金塊'			=> '金の胸当て', },
	'さまよう鎧'	=> { '魔除けの聖印'	=> 'ﾗｲﾄｱｰﾏｰ', },
	'みかわしの服'	=> { 'ｽﾃﾃｺﾊﾟﾝﾂ'		=> '安らぎのﾛｰﾌﾞ', '悪魔のしっぽ'	=> '闇の衣', },
	'ｼﾙﾊﾞｰﾒｲﾙ'		=> { 'ｿﾞﾝﾋﾞｷﾗｰ'		=> 'ｿﾞﾝﾋﾞﾒｲﾙ', '魔獣の皮' => 'ﾄﾞﾗｺﾞﾝﾒｲﾙ', },
	'ｿﾞﾝﾋﾞﾒｲﾙ'		=> { '聖者の灰'		=> 'ﾌﾟﾗﾁﾅﾒｲﾙ', },
	'魔法の法衣'	=> { '聖者の灰'		=> '賢者のﾛｰﾌﾞ', },
	'賢者のﾛｰﾌﾞ'	=> { '炎の鎧'		=> '紅蓮のﾛｰﾌﾞ', },
	'光の鎧'		=> { '危ない水着'	=> '神秘の鎧', },#
	'毛皮のﾏﾝﾄ'		=> { 'はやてのﾘﾝｸﾞ'	=> '盗賊の衣', },
	'魔人の鎧'		=> { 'ごうけつの腕輪'=> 'ｷﾞｶﾞﾝﾄｱｰﾏｰ', },
	'古びた鎧'		=> { 'ｵﾘﾊﾙｺﾝ'		=> 'ﾊｸﾞﾚﾒﾀﾙの鎧', },#
	'ﾊｸﾞﾚﾒﾀﾙの鎧'	=> { 'ｽﾗｲﾑの冠'		=> 'ﾒﾀﾙｷﾝｸﾞの鎧', },#
	'ﾒﾀﾙｷﾝｸﾞの鎧'	=> { 'ﾛﾄの印'		=> 'ﾛﾄの鎧', },#
	'ﾄﾞﾗｺﾞﾝﾒｲﾙ'		=> { 'ごうけつの腕輪'=> 'ﾄﾞﾗｺﾞﾝｱｰﾏｰ', },#
	'ﾄﾞﾗｺﾞﾝｱｰﾏｰ'	=> { 'ｵﾘﾊﾙｺﾝ'		=> '竜神の鎧', },#
	'竜神の鎧'		=> { 'ﾊｸﾞﾚﾒﾀﾙの鎧'	=> '竜神王の鎧', },#
);




1; # 削除不可
