#=================================================
# 交流広場 Created by Merino
#=================================================
# 場所名
$this_title = '交流広場';

# NPC名
$npc_name = '@町娘';

# ログに使うファイル(.cgi抜き)
$this_file  = "$logdir/park";

# 背景画像
$bgimg   = "$bgimgdir/park.gif";


#=================================================
# はなす言葉
#=================================================
@words = (
	"$mさんこんにちわ",
	"今日はいい天気ですね～",
	"夕方からはお天気が悪くなるみたいですよ",,
	"今日の夕飯は何を作ろうかしら。$mさんはどんな食べ物が好きですか？",
	"あら、$mさん♪今日も元気そうですね",
	"これからどこに行くんですか？",
	"$mさんを占ってあげましょう",
	"私の占いって結構\当たるらしいですよ",
	"趣味は占いです",
	"$mさんの職業は$jobs[$m{job}][1]ですね？どうですか？当たりですか？",
);
#=================================================
# ＠しらべる>NPC
#=================================================
sub shiraberu_npc {
	@words = (qw/
		何かお探しですか？
		メガネメガネ…
		はい！メガネ！
		お探し物はこれですか？-Ｏ-Ｏ-
		キャッ！何しているんですか！
	/);
	&hanasu;
}

#=================================================
# 追加アクション
#=================================================
push @actions, 'うらない';
$actions{'うらない'} = sub{ &uranai; }; 

#=================================================
# ＠うらない
#=================================================
sub uranai {
	my @words = (qw/大吉 吉 中吉 末吉 小吉 凶 大凶 大吉 吉 中吉 末吉 小吉 凶 大凶 ハッピー アンハッピー オッパピー 残念 頑張って 愛があります 開き直ってください 何か起きます/);
	my $word  = $words[int(rand(@words))];
	my @words2 = (qw/黒 白 青 赤 空 ピンク 紫 緑 灰 ブルー 水 肌 オレンジ 黄 茶 ワインレッド 猫 海 土 森 藍 杏子 イチゴ オリーブ 金 銀 パール /);
	my $word2  = $words2[int(rand(@words2))];
	$npc_com = "今日の$m{name}さんの運勢はずばり…$wordです♪ラッキーカラーは$word2色ですよ～。";
}



1; # 削除不可
