require './lib/system.cgi';
#================================================
$VERSION = '1.30';
# 設定ファイル Created by Merino
#================================================
# 管理画面のURL
# http://自分のURL/party/admin.cgi?pass=管理者パスワード
# ※「自分のURL」とはこのCGIを設置した場所までのアドレス
#================================================
# メンテナンス表示(分) 通常稼動時は「0」
$mente_min = 0;

# 管理パスワード(適当な半角英数字に必ず変更してください)
$admin_pass = '0123';

# 次に行動できるまでの待ち時間(秒)。戦闘用の待ち時間は「./lib/quest.cgiの%speeds」で設定
$act_time = 7;

# 待ち時間のゲージの横幅(px)
$gage_width = 140;

# 睡眠時間「＠ねる」の拘束時間(分)
$sleep_time = 10;

# gzip圧縮転送(わからない・使わない場合は空欄 '' )
$gzip = '';

# ----------------------------
# タイトル
$title = '＠パーティーII';

# タイトル画像(必要ない場合は「''」)
$title_img = './icon/etc/title.png';

# 戻り先URL
$home = 'http://tenaku.com/';

# 設置Path(/index.cgiを除いたhttp://～のURL)ブログパーツ用リンク
$game_path = 'http://party.xii.jp';

# ----------------------------
# 最大登録人数
$max_entry = 200;

# 最大ログイン人数
$max_login = 30;

# Topのログインリストに表示する時間(分)
$login_time = 15;

# 自動削除期間(日)。この日にちを超えてもログインしないユーザーは削除
$auto_delete_day = 30;

# ----------------------------
# 右下に表示される著作表示。HTMLタグ使用可能(「$copyright = <<"EOM";」～「EOM」の間に記述)
$copyright = <<"EOM";
<!-- ここから -->



<!-- ここまで -->
EOM

# ----------------------------
# 最大ログ保存件数
$max_log     = 30;

# 最大コメント文字数(半角)
$max_comment = 500;

# 同プレイヤーによる手紙の連続書き込み禁止時間(秒)
$bad_time    = 30;

# 最大スクリーンショット所持数
$max_screen_shot = 20;


# ----------------------------
# メンバーとして表示される時間(秒)
$limit_member_time = 60 * 5;

# 自動リロード時間(秒) ◎追加/変更/並び替え自由
@reload_times = (0, 10, 15, 20, 30, 60, 90);

# 更新(F5)連打防止。この秒数間に更新するとエラー(秒)
$wait_time = 1;


# ----------------------------
# デフォルトカラー
$default_color = '#FFFFFF';

# デフォルトのNPC名
$npc_name  = '＠',

# デフォルトのNPCカラー
$npc_color = '#FF69B4',


# ----------------------------
# 戦闘に必要な変数(追加可能)
@battle_datas = (qw/name addr color time ten job sp old_job old_sp mhp hp mmp mp mat at mdf df mag ag hit state tmp get_exp get_money icon wea arm/);

# カジノに必要な変数(追加可能)
@casino_datas = (qw/name addr color time icon action card/);


# 冒険場所(./stage/○.cgiと関連づいている。増やす場合は./stage/○.cgiも増やす)
@stages = ('プニプニ平原','キノコの森','幽霊城','海辺の洞窟','地獄の砂浜','魔術師の塔','荒野の獣道','マグマ山','妖精の森','スライムランド','死霊の沼地','ドラゴンの谷','暗黒魔城','死の大地','魔界',
#           0              1            2        3            4            5            6            7          8          9                10           11             12         13         14
           '鏡の世界','マダムガーデン','幻の秘境','闇のランプ','封印の地','天空城','カオスフィールド',
#           15         16               17         18           19         20       21
);

# ＠ダンジョン(./map/○/と関連づいている。増やす場合は./map/○/も増やす)
@dungeons = ('クルクの洞窟','レヌール城','トース塔','迷いの森','死の大迷路','風の神殿','賢者の小道','炎の洞窟','絶望の砂漠','力の洞窟','魔法の塔','ヘブンズドア','ヘルズゲート');
#             0              1            2          3          4            5          6            7          8            9          10         11,            12 

# ＠チャレンジ(./challenge/○/と関連づいている。増やす場合は./challenge/○/も増やす)
@challenges = ('最弱逆襲','怒羊牧場','恐怖肝試','幻覚猛毒','即死博打','花火大会','鉄壁要塞','最強王者',);
#               0          1          2          3          4          5          6          7

# ＠まち
@towns = (
	['メケメケ村',		'town1'], # 0
	['キノコ町',		'town2'], # 1
	['スライム町',		'town3'], # 2
	['ガイア国',		'town4'], # 3
);


# ＠いどう
@places = (
	# 場所名,				使用するライブラリ(./lib/******.cgi)
	['冒険に出る',			'quest'],
	['カジノ',				'casino'],
	['預かり所',			'depot'],
	['武器屋',				'weapon'],
	['防具屋',				'armor'],
	['道具屋',				'item'],
	['ルイーダの酒場',		'bar'],

	['福引所',				'lot'],
	['モンスターじいさん',	'farm'],
	['フォトコン会場',		'photo'],
	['オラクル屋',			'goods'],
	['メダル王の城',		'medal'],
	['ダーマ神殿',			'job_change'],
	['交流広場',			'park'],

	['オークション会場',	'auction'],
	['イベント広場',		'event'],
	['願いの泉',			'sp_change'],
	['復活の祭壇',			'reborn'],
	['ギルド協会',			'join_guild'],
	['命名の館',			'name_change'],
	['追放騎士団',			'exile'],
);

#=================================================
# 値の日本語読み ◎追加/変更/並び替え自由
#=================================================
%e2j = ( # English to Japanese
	sex		=> '性別',
	m		=> '男',
	f		=> '女',
	mhp		=> 'ＨＰ',
	mmp		=> 'ＭＰ',
	hp		=> 'ＨＰ',
	mp		=> 'ＭＰ',
	at		=> '攻撃力',
	df		=> '守備力',
	ag		=> '素早さ',
	hit		=> '命中率',
	state	=> '状態',
	sp		=> 'SP',
	lv		=> 'Lv.',
	exp		=> '経験値',
	money	=> 'ゴールド',
	tired	=> '疲労',
);



#================================================
# スパム/荒らし対策設定
#================================================
# アクセス拒否者へのメッセージ
$deny_message = 'あなたのIPアドレスはアクセス制限がかかっています';

# アクセス拒否リスト「 '禁止IPアドレスまたはホスト名', 」
# アスタリスク(*)で前方一致(例> '*.proxy',)、後方一致(例> '127.0.0.*',)
@deny_lists = (
	'*.anonymizer.com',
);

#================================================
# 各ファイル設定
#================================================
$userdir  = './user';
$icondir  = './icon';
$bgimgdir = './bgimg';
$guilddir = './guild';
$logdir   = './log';
$questdir = './quest';
$casinodir = './casino';
$htmldir  = './html';
$stagedir = './stage';
$mapdir   = './map';
$challengedir = './challenge';
$script       = 'party.cgi';
$script_index = 'index.cgi';

$method = 'POST';
$chmod  = 0666;
$mkdir  = 0777;


1; # 削除不可
